{
  "name": "Recursive Project Scanning",
  "version": "1.0.0",
  "description": "Extend IProjectDetector and directory scanning to recursively discover projects in nested directories, intelligently skipping well-known non-project directories (node_modules, bin, obj, .git, etc.). Adds a --recursive CLI flag to scan and install commands.",
  "apiSurface": "api.cs",
  "goals": [
    "Recursively discover all project types (.sln, .csproj, package.json, pyproject.toml, pom.xml, build.gradle, etc.) in nested directories from a given root",
    "Skip well-known non-project directories to avoid wasted I/O and false positives",
    "Provide a configurable maximum depth to prevent unbounded traversal in deeply nested file systems",
    "Maintain backward compatibility — existing single-directory detection continues to work unchanged",
    "Integrate recursive scanning into the CLI scan and install commands via a --recursive flag"
  ],
  "stories": [
    {
      "id": "S01",
      "title": "Recursive Detection in ProjectDetector",
      "description": "Extend IProjectDetector and ProjectDetector to support recursive directory traversal with smart exclusions.",
      "tasks": [
        {
          "id": "S01-T01",
          "title": "Define ProjectDetectionOptions Record",
          "completed": true,
          "description": "Create a configuration record that controls recursive scanning behavior with Recursive (bool, default false) and MaxDepth (int, default 5) properties.",
          "apiReferences": [
            "ProjectDetectionOptions"
          ],
          "requirements": [
            "Define record ProjectDetectionOptions with Recursive (default false) and MaxDepth (default 5) properties",
            "Place in SmartSkills.Core.Scanning namespace"
          ],
          "dod": "Record is defined and compiles.",
          "verifications": [
            "dotnet build succeeds"
          ]
        },
        {
          "id": "S01-T02",
          "title": "Add Detect Overload with Options",
          "completed": true,
          "description": "Add an overload of IProjectDetector.Detect that accepts ProjectDetectionOptions. The existing parameterless overload delegates to the new one with default options.",
          "apiReferences": [
            "IProjectDetector",
            "ProjectDetectionOptions"
          ],
          "requirements": [
            "Add Detect(string directoryPath, ProjectDetectionOptions options) to IProjectDetector",
            "Existing Detect(string directoryPath) remains and delegates to new overload with default options (Recursive = false)",
            "Backward compatible — no breaking changes to existing callers"
          ],
          "dod": "Interface has both overloads; existing callers compile unchanged.",
          "verifications": [
            "dotnet build succeeds",
            "All existing tests pass"
          ]
        },
        {
          "id": "S01-T03",
          "title": "Implement Recursive Traversal in ProjectDetector",
          "completed": true,
          "description": "Implement recursive directory walking with exclusion and pruning. When Recursive is true, enumerate subdirectories (skipping excluded ones), detect projects at each level, and apply prune-on-detection strategy per ecosystem.",
          "apiReferences": [
            "ProjectDetector",
            "ExcludedDirectories",
            "ProjectDetectionOptions"
          ],
          "requirements": [
            "When options.Recursive is false, behave exactly as today",
            "When options.Recursive is true, enumerate subdirectories skipping any in the global exclude set (case-insensitive)",
            "Apply prune-on-detection: when a project marker is found for an ecosystem, do not recurse deeper for that ecosystem",
            "Respect options.MaxDepth limit",
            "Track visited directories to avoid symlink cycles",
            "Log skipped directories at Debug level"
          ],
          "dod": "ProjectDetector.Detect(path, new ProjectDetectionOptions { Recursive = true }) discovers projects in nested directories while skipping excluded dirs.",
          "verifications": [
            "Unit test: monorepo layout with projects at different depths — all discovered",
            "Unit test: node_modules subtrees are skipped",
            "Unit test: .git directory is skipped",
            "Unit test: depth limit is respected",
            "Unit test: symlink cycles do not cause infinite recursion",
            "All existing non-recursive tests pass unchanged"
          ]
        },
        {
          "id": "S01-T04",
          "title": "Consolidate Exclusion List",
          "completed": true,
          "description": "Extract the exclusion list into a shared ExcludedDirectories static class with categorized sets (Universal, DotNet, NodeJs, Python, Java, BuildOutput) and a combined All set.",
          "apiReferences": [
            "ExcludedDirectories"
          ],
          "requirements": [
            "Create static class ExcludedDirectories in SmartSkills.Core.Scanning",
            "Provide IReadOnlySet<string> All — combined set with case-insensitive comparison",
            "Provide individual category sets: Universal, DotNet, NodeJs, Python, Java, BuildOutput",
            "Update ProjectDetector to use ExcludedDirectories.All instead of inline arrays",
            "Remove existing PythonExcludedDirs array from ProjectDetector"
          ],
          "dod": "All exclusion logic uses the centralized ExcludedDirectories class.",
          "verifications": [
            "ExcludedDirectories.All contains all expected entries",
            "Existing node_modules and Python venv exclusions still work",
            "dotnet build succeeds"
          ]
        }
      ]
    },
    {
      "id": "S02",
      "title": "Integrate Recursive Scanning into LibraryScanner",
      "description": "Wire the recursive detection through LibraryScanner.ScanDirectoryAsync.",
      "tasks": [
        {
          "id": "S02-T01",
          "title": "Add ScanDirectoryAsync Overload with Options",
          "completed": true,
          "description": "Add an overload of ScanDirectoryAsync that accepts ProjectDetectionOptions, passes it to the project detector, and deduplicates results.",
          "apiReferences": [
            "ILibraryScanner",
            "LibraryScanner",
            "ProjectDetectionOptions"
          ],
          "requirements": [
            "Add ScanDirectoryAsync(string, ProjectDetectionOptions, CancellationToken) to ILibraryScanner",
            "Existing ScanDirectoryAsync(string, CancellationToken) delegates to new overload with default options",
            "New overload passes options to _projectDetector.Detect(directoryPath, options)",
            "Deduplicate results — same project file discovered via multiple paths is included only once"
          ],
          "dod": "ScanDirectoryAsync can scan recursively when options say so.",
          "verifications": [
            "Existing calls to ScanDirectoryAsync(path, ct) work unchanged",
            "Recursive call discovers nested projects",
            "No duplicate ProjectPackages for the same project file"
          ]
        }
      ]
    },
    {
      "id": "S03",
      "title": "CLI --recursive Flag",
      "description": "Expose recursive scanning to the user via CLI flags on scan and install commands.",
      "tasks": [
        {
          "id": "S03-T01",
          "title": "Add --recursive Option to scan Command",
          "completed": false,
          "description": "Add --recursive (-r) boolean flag and --depth integer option to the scan CLI command. Pass as ProjectDetectionOptions to ScanDirectoryAsync.",
          "requirements": [
            "Add Option<bool>(\"--recursive\") with alias -r, default false",
            "Add Option<int>(\"--depth\") with default 5, only meaningful when --recursive is set",
            "Pass values as ProjectDetectionOptions to ScanDirectoryAsync",
            "Display discovered project paths grouped by ecosystem in output"
          ],
          "dod": "smart-skills scan --recursive discovers and scans projects in nested directories.",
          "verifications": [
            "smart-skills scan --recursive in a monorepo shows nested projects",
            "smart-skills scan (without --recursive) behaves as before",
            "smart-skills scan --recursive --depth 1 limits to one level",
            "smart-skills scan --recursive --json includes all discovered projects"
          ]
        },
        {
          "id": "S03-T02",
          "title": "Add --recursive Option to install Command",
          "completed": false,
          "description": "Add the same --recursive and --depth flags to the install command. Aggregate packages from all discovered projects before matching against the registry.",
          "requirements": [
            "Add --recursive and --depth options (same as scan)",
            "Pass through to SkillInstaller → LibraryScanner.ScanDirectoryAsync with options",
            "Aggregate packages from all discovered projects before registry matching",
            "--dry-run with --recursive previews all matched skills across the monorepo"
          ],
          "dod": "smart-skills install --recursive installs skills for all projects in a directory tree.",
          "verifications": [
            "smart-skills install --recursive --dry-run shows matched skills from nested projects",
            "Skills from multiple ecosystems in a monorepo are all resolved"
          ]
        }
      ]
    },
    {
      "id": "S04",
      "title": "Testing",
      "description": "Comprehensive tests for recursive scanning, exclusion logic, and CLI integration.",
      "tasks": [
        {
          "id": "S04-T01",
          "title": "Unit Tests for ExcludedDirectories",
          "completed": false,
          "description": "Verify the exclusion list is complete and correct, including case-insensitive lookup.",
          "requirements": [
            "Test that All contains every expected directory name",
            "Test case-insensitive lookup (e.g., Node_Modules is excluded)",
            "Test that individual category sets contain expected entries"
          ],
          "dod": "Exclusion list has full test coverage.",
          "verifications": [
            "dotnet test --filter \"FullyQualifiedName~ExcludedDirectories\" passes"
          ]
        },
        {
          "id": "S04-T02",
          "title": "Unit Tests for Recursive ProjectDetector",
          "completed": false,
          "description": "Test recursive traversal with various directory layouts using temp directories in test setup.",
          "requirements": [
            "Test: flat layout (single project at root) with Recursive = true",
            "Test: nested monorepo (projects at depth 2 and 3) — all found within MaxDepth",
            "Test: excluded directories (node_modules/package.json, .git/) are skipped",
            "Test: mixed ecosystems (.csproj at root, package.json in subdirectory) — both found",
            "Test: depth boundary — project at depth 6 with MaxDepth = 5 — not found",
            "Test: Recursive = false still works as before"
          ],
          "dod": "Recursive detection logic has full coverage of edge cases.",
          "verifications": [
            "dotnet test --filter \"FullyQualifiedName~ProjectDetector\" passes"
          ]
        },
        {
          "id": "S04-T03",
          "title": "Unit Tests for Recursive LibraryScanner",
          "completed": false,
          "description": "Test ScanDirectoryAsync with recursive options discovers and resolves packages from nested projects, with deduplication.",
          "requirements": [
            "Mock IProjectDetector to return projects at various depths",
            "Verify ScanDirectoryAsync resolves packages for all discovered projects",
            "Verify deduplication when a project appears via both direct detection and solution membership"
          ],
          "dod": "Scanner integration with recursive detection is tested.",
          "verifications": [
            "dotnet test --filter \"FullyQualifiedName~LibraryScanner\" passes"
          ]
        },
        {
          "id": "S04-T04",
          "title": "CLI Integration Tests",
          "completed": false,
          "description": "Test the --recursive flag end-to-end for both scan and install commands.",
          "requirements": [
            "Test scan --recursive in a directory with nested projects",
            "Test scan --recursive --depth 0 behaves like non-recursive scan",
            "Test install --recursive --dry-run aggregates skills across nested projects"
          ],
          "dod": "CLI recursive flags work end-to-end.",
          "verifications": [
            "dotnet test --filter \"FullyQualifiedName~Cli.Tests\" passes"
          ]
        }
      ]
    }
  ]
}
