{
  "name": "Smart Skills Installer CLI",
  "version": "1.0.0",
  "description": "A C# toolset that inspects installed libraries in a .NET project and automatically installs relevant agent skills by fetching them from remote sources (public GitHub repositories or authenticated Azure DevOps URLs). The primary acquisition mechanism is MSBuild integration—skills are resolved and installed as part of the build pipeline via custom MSBuild targets/tasks. A companion CLI tool is provided for manual operations, diagnostics, and configuration.",
  "apiSurface": "api.cs",
  "goals": [
    "Automate the discovery and installation of agent skills based on project dependencies",
    "Provide MSBuild-native integration so skills are acquired automatically during build",
    "Support multiple remote skill sources (GitHub, Azure DevOps)",
    "Provide a seamless developer experience with minimal configuration—just add a NuGet package",
    "Ensure secure credential handling for authenticated sources",
    "Support incremental builds so skill acquisition only runs when dependencies change"
  ],
  "stories": [
    {
      "id": "S01",
      "title": "Project Scaffolding & CLI Framework",
      "description": "Set up the .NET console application with a CLI framework for parsing commands, options, and arguments.",
      "tasks": [
        {
          "id": "S01-T01",
          "title": "Initialize .NET Console Project",
          "completed": true,
          "description": "Create a .NET solution with a shared core class library and a console application project. The core library contains all scanning, matching, fetching, and installation logic so it can be consumed by both the CLI and the MSBuild task projects.",
          "requirements": [
            "Use .NET 10 (net10.0)",
            "Project should follow standard .NET solution structure with src/ and tests/ folders",
            "Create SmartSkills.Core class library project for shared logic (scanning, matching, fetching, installing)",
            "Create SmartSkills.Cli console application project depending on SmartSkills.Core",
            "Create SmartSkills.MSBuild class library project for custom MSBuild tasks depending on SmartSkills.Core",
            "Include a .gitignore, Directory.Build.props, and global.json"
          ],
          "dod": "A buildable .NET solution exists with Core, Cli, and MSBuild projects with proper folder structure.",
          "verifications": [
            "'dotnet build' completes without errors for all projects",
            "'dotnet run --project src/SmartSkills.Cli' prints a placeholder help message",
            "Solution file references Core, Cli, MSBuild, and test projects",
            "Core library can be referenced by both Cli and MSBuild projects"
          ]
        },
        {
          "id": "S01-T02",
          "title": "Integrate CLI Parsing Library",
          "completed": true,
          "description": "Add System.CommandLine NuGet package and configure root command with global options (--verbose, --config, --dry-run).",
          "requirements": [
            "Use System.CommandLine for argument parsing",
            "Support global options: --verbose (enable detailed logging), --config <path> (custom config file), --dry-run (preview actions without executing)",
            "Provide auto-generated --help and --version support"
          ],
          "dod": "CLI accepts and parses global options and displays help text when invoked with --help.",
          "verifications": [
            "'dotnet run -- --help' displays usage info with all global options",
            "'dotnet run -- --version' displays the tool version",
            "Unrecognized arguments produce a clear error message"
          ]
        },
        {
          "id": "S01-T03",
          "title": "Integrate Hosting Extensions",
          "completed": true,
          "description": "Set up the application using the .NET Generic Host (Microsoft.Extensions.Hosting) for dependency injection, configuration, and logging infrastructure.",
          "requirements": [
            "Use Microsoft.Extensions.Hosting for application lifecycle",
            "Register services via dependency injection",
            "Configure logging with Microsoft.Extensions.Logging",
            "Support IConfiguration binding for settings"
          ],
          "dod": "Application bootstraps with Generic Host, DI container resolves services, and logging outputs to console.",
          "verifications": [
            "Services are resolved from the DI container at runtime",
            "Logging output appears in the console with configurable verbosity",
            "Application starts and shuts down cleanly"
          ]
        }
      ]
    },
    {
      "id": "S02",
      "title": "Library Detection & Scanning",
      "description": "Detect installed libraries/packages in the target project using an extensible package resolver abstraction. Rather than manually parsing .csproj files and reimplementing MSBuild's complex import/resolution logic, we delegate to purpose-built tooling that already handles all of this correctly.",
      "tasks": [
        {
          "id": "S02-T01",
          "title": "Implement Library Scanner SDK in SmartSkills.Core",
          "completed": true,
          "description": "Build the core scanning API in SmartSkills.Core that accepts a project or solution (.sln/.slnx) path and returns a list of detected packages. This is the reusable SDK consumed by both the CLI and MSBuild tasks. Use Microsoft.VisualStudio.SolutionPersistence NuGet package for parsing solution files — it supports both .sln and .slnx formats via a unified SolutionModel API.",
          "apiReferences": [
            "ILibraryScanner",
            "ProjectPackages"
          ],
          "requirements": [
            "Accept both project file (.csproj) and solution file (.sln/.slnx) paths",
            "Use Microsoft.VisualStudio.SolutionPersistence for solution file parsing",
            "Delegate package resolution to IPackageResolver",
            "Return ProjectPackages with the full resolved dependency list per project"
          ],
          "dod": "ILibraryScanner implementation can scan both projects and solutions, returning ProjectPackages for each.",
          "verifications": [
            "ScanProjectAsync returns correct packages for a single project",
            "ScanSolutionAsync returns packages for all projects in a solution",
            "Both .sln and .slnx formats are supported"
          ]
        },
        {
          "id": "S02-T02",
          "title": "Define IPackageResolver Abstraction",
          "completed": true,
          "description": "Define an IPackageResolver interface in SmartSkills.Core that abstracts package resolution. The interface accepts a project path and returns a unified list of resolved packages (name, version, whether direct or transitive, target framework). Register implementations via dependency injection.",
          "apiReferences": [
            "IPackageResolver",
            "ResolvedPackage"
          ],
          "requirements": [
            "Define IPackageResolver with ResolvePackagesAsync method",
            "ResolvedPackage includes Name, Version, IsTransitive, TargetFramework, RequestedVersion",
            "Register implementations via DI for extensibility",
            "Support CancellationToken for all async operations"
          ],
          "dod": "IPackageResolver interface is defined and registered in the DI container.",
          "verifications": [
            "Interface compiles and can be resolved from DI",
            "At least one implementation (DotnetCliPackageResolver) is registered as default"
          ]
        },
        {
          "id": "S02-T03",
          "title": "Implement DotnetCliPackageResolver",
          "completed": true,
          "description": "Implement IPackageResolver by shelling out to 'dotnet list package --include-transitive --format json'. This leverages the .NET SDK's own NuGet restore and resolution engine, which correctly handles all MSBuild evaluation complexity (.props/.targets imports, Central Package Management, conditional references, multi-targeting, etc.). Parse the JSON output (available since .NET SDK 7.0.200) to extract the full resolved dependency graph.",
          "apiReferences": [
            "IPackageResolver",
            "ResolvedPackage",
            "ProjectPackages"
          ],
          "requirements": [
            "Shell out to 'dotnet list package --include-transitive --format json'",
            "Parse JSON output to extract direct and transitive packages with resolved versions",
            "Handle error cases: missing SDK, restore failures, malformed output",
            "Return IsTransitive flag correctly for each package",
            "Include TargetFramework for multi-targeting projects"
          ],
          "dod": "DotnetCliPackageResolver correctly resolves all direct and transitive packages for a .NET project.",
          "verifications": [
            "Correctly parses sample JSON output from 'dotnet list package'",
            "Handles multi-targeting projects with per-framework package lists",
            "Returns meaningful error when dotnet CLI is not available",
            "Gracefully handles restore failures"
          ]
        },
        {
          "id": "S02-T04",
          "title": "Implement 'scan' CLI Command",
          "completed": true,
          "description": "Add a 'scan' subcommand to SmartSkills.Cli that wraps the Core scanning SDK, accepts an optional project/solution path (defaults to current directory), and displays results in a human-readable table with JSON output support.",
          "requirements": [
            "Accept optional --project/-p argument for project/solution path",
            "Default to current directory if no path specified",
            "Display results as human-readable table by default",
            "Support --json flag for machine-readable output",
            "Show package name, version, direct/transitive status, and target framework"
          ],
          "dod": "'smart-skills scan' displays resolved packages for a project.",
          "verifications": [
            "Command runs successfully with explicit project path",
            "Command auto-detects project/solution in current directory",
            "--json flag outputs valid JSON",
            "Table output is human-readable with aligned columns"
          ]
        }
      ]
    },
    {
      "id": "S03",
      "title": "Skill Registry & Mapping Configuration",
      "description": "Define and manage the mapping between library names and their corresponding agent skills. Skills follow the open Agent Skills specification (https://agentskills.io/specification.md) — each skill is a directory containing a SKILL.md file with YAML frontmatter followed by Markdown instructions.",
      "tasks": [
        {
          "id": "S03-T01",
          "title": "Define Skill Manifest Schema",
          "completed": true,
          "description": "Adopt the Agent Skills specification as the skill format. A skill is a directory whose name matches the name frontmatter field, containing at minimum a SKILL.md file. The YAML frontmatter provides the metadata (name, description, license, compatibility, metadata map, allowed-tools). No custom manifest schema is needed — the SKILL.md frontmatter IS the manifest.",
          "apiReferences": [
            "SkillMetadata"
          ],
          "requirements": [
            "Use Agent Skills spec as the manifest format (SKILL.md frontmatter)",
            "Required fields: name (1-64 chars, lowercase alphanumeric + hyphens), description (1-1024 chars)",
            "Optional fields: license, compatibility (≤500 chars), metadata (string→string map), allowed-tools (space-delimited)",
            "Skill directory name must match the name field"
          ],
          "dod": "SkillMetadata record correctly models the Agent Skills spec frontmatter fields.",
          "verifications": [
            "SkillMetadata can represent all Agent Skills spec fields",
            "Name validation enforces spec constraints (1-64 chars, lowercase, hyphens)",
            "Description validation enforces 1-1024 char limit"
          ]
        },
        {
          "id": "S03-T02",
          "title": "Implement Skill Registry Index",
          "completed": true,
          "description": "Create a registry index file format that maps NuGet package names/patterns to available skills. The index is hosted alongside skill directories in the remote source. Each entry maps one or more library names (or glob patterns) to a skill directory path in the repository.",
          "apiReferences": [
            "RegistryEntry",
            "ISkillRegistry"
          ],
          "requirements": [
            "Define a JSON/YAML index file format for package-to-skill mappings",
            "Support exact name and glob pattern matching in package patterns",
            "Each entry maps PackagePatterns to a SkillPath",
            "ISkillRegistry loads entries from all configured source providers"
          ],
          "dod": "Registry index can be parsed and entries loaded from remote sources.",
          "verifications": [
            "Index file parses correctly with sample data",
            "Glob patterns match expected package names",
            "Multiple entries can map to the same or different skills"
          ]
        },
        {
          "id": "S03-T03",
          "title": "Implement Library-to-Skill Matching Engine",
          "completed": true,
          "description": "Build the matching engine that takes a list of detected libraries (from IPackageResolver) and resolves them to applicable skills from the registry index. Support exact name matches, prefix/glob patterns, and priority ordering when multiple skills match.",
          "apiReferences": [
            "ISkillMatcher",
            "MatchedSkill",
            "ResolvedPackage",
            "RegistryEntry"
          ],
          "requirements": [
            "Match packages against registry entries using exact and glob patterns",
            "Return MatchedSkill with the RegistryEntry and SourceProvider",
            "Support priority ordering when multiple skills match the same package",
            "Handle case-insensitive matching for NuGet package names"
          ],
          "dod": "ISkillMatcher correctly matches packages to skills with pattern support.",
          "verifications": [
            "Exact name match works correctly",
            "Glob pattern (e.g., 'Microsoft.EntityFrameworkCore*') matches expected packages",
            "Priority ordering resolves conflicts when multiple skills match",
            "Case-insensitive matching works for NuGet packages"
          ]
        }
      ]
    },
    {
      "id": "S04",
      "title": "Skill Source Provider Abstraction",
      "description": "Define an extensible ISkillSourceProvider abstraction in SmartSkills.Core that encapsulates all interaction with a remote skill repository. This abstraction allows the installation engine to work uniformly across different hosting backends.",
      "tasks": [
        {
          "id": "S04-T01",
          "title": "Define ISkillSourceProvider Interface",
          "completed": true,
          "description": "Define the interface in SmartSkills.Core with methods: GetRegistryIndexAsync to fetch the parsed registry index; ListSkillFilesAsync to enumerate all files in a skill directory tree; DownloadFileAsync to download a single raw file; and GetLatestCommitShaAsync to return the SHA of the most recent commit affecting the given skill directory. All methods accept a CancellationToken.",
          "apiReferences": [
            "ISkillSourceProvider",
            "RegistryEntry"
          ],
          "requirements": [
            "Define GetRegistryIndexAsync returning IReadOnlyList<RegistryEntry>",
            "Define ListSkillFilesAsync(skillPath) returning IReadOnlyList<string>",
            "Define DownloadFileAsync(filePath) returning Stream",
            "Define GetLatestCommitShaAsync(skillPath) returning string",
            "Include ProviderType string property for identification",
            "All async methods accept CancellationToken"
          ],
          "dod": "ISkillSourceProvider interface is defined with all four methods plus ProviderType property.",
          "verifications": [
            "Interface compiles and can be implemented",
            "All methods have CancellationToken parameter",
            "ProviderType property is available for state tracking"
          ]
        },
        {
          "id": "S04-T02",
          "title": "Implement Commit-SHA-Based Cache in Installation Engine",
          "completed": true,
          "description": "Before downloading a skill, call GetLatestCommitShaAsync and compare the returned SHA against the SHA stored in the local state file from the previous install. If the SHA matches, skip the download entirely and report the skill as up-to-date. Store the SHA in the local state file alongside each installed skill entry.",
          "apiReferences": [
            "InstalledSkill.CommitSha",
            "ISkillSourceProvider.GetLatestCommitShaAsync",
            "ISkillStore"
          ],
          "requirements": [
            "Call GetLatestCommitShaAsync before downloading each skill",
            "Compare remote SHA against locally stored SHA in InstalledSkill.CommitSha",
            "Skip download if SHA matches and report as up-to-date",
            "Store the new SHA when installing or updating a skill",
            "Minimize API calls by batching SHA checks where possible"
          ],
          "dod": "Skills with unchanged commit SHA are skipped during install, reducing unnecessary downloads.",
          "verifications": [
            "Unchanged skill is reported as skipped/up-to-date",
            "Changed skill (different SHA) triggers re-download",
            "New skill (no local state) is always downloaded",
            "SHA is persisted in the local state file after install"
          ]
        }
      ]
    },
    {
      "id": "S05",
      "title": "GitHub Skill Source Provider",
      "description": "Implement ISkillSourceProvider for public (and optionally authenticated) GitHub repositories.",
      "tasks": [
        {
          "id": "S05-T01",
          "title": "Implement GitHub HTTP Client",
          "completed": true,
          "description": "Create an HTTP client wrapper for GitHub REST API and raw content access (raw.githubusercontent.com), with rate limiting awareness, retry logic, and optional PAT authentication.",
          "requirements": [
            "Use HttpClient with GitHub API base URL",
            "Support optional Personal Access Token (PAT) authentication",
            "Detect and handle GitHub rate limiting (403 with X-RateLimit headers)",
            "Implement retry logic with exponential backoff",
            "Set appropriate User-Agent header"
          ],
          "dod": "GitHub HTTP client handles authentication, rate limiting, and retries.",
          "verifications": [
            "Authenticated requests include Authorization header",
            "Rate limit responses trigger appropriate backoff",
            "Retry logic handles transient failures"
          ]
        },
        {
          "id": "S05-T02",
          "title": "Implement GitHubSkillSourceProvider",
          "completed": true,
          "description": "Implement ISkillSourceProvider using the GitHub API: use the Git Trees API (GET /repos/{owner}/{repo}/git/trees/{sha}?recursive=1) to list files; use raw content URLs to download files; use the Commits API (GET /repos/{owner}/{repo}/commits?path={skillPath}&per_page=1) to resolve the latest commit SHA.",
          "apiReferences": [
            "ISkillSourceProvider"
          ],
          "requirements": [
            "Implement GetRegistryIndexAsync using raw content download",
            "Implement ListSkillFilesAsync using Git Trees API with recursive=1",
            "Implement DownloadFileAsync using raw.githubusercontent.com URLs",
            "Implement GetLatestCommitShaAsync using Commits API with path filter",
            "Set ProviderType to 'github'"
          ],
          "dod": "GitHubSkillSourceProvider correctly implements all ISkillSourceProvider methods.",
          "verifications": [
            "ListSkillFilesAsync returns all files in a skill directory",
            "DownloadFileAsync retrieves correct file content",
            "GetLatestCommitShaAsync returns the correct commit SHA",
            "GetRegistryIndexAsync parses the index correctly"
          ]
        }
      ]
    },
    {
      "id": "S06",
      "title": "Azure DevOps Skill Source Provider",
      "description": "Implement ISkillSourceProvider for authenticated Azure DevOps (ADO) Git repositories.",
      "tasks": [
        {
          "id": "S06-T01",
          "title": "Implement ADO Authentication",
          "completed": true,
          "description": "Support multiple ADO authentication methods: Personal Access Token (PAT), Azure CLI credential, and Managed Identity.",
          "requirements": [
            "Support PAT-based authentication",
            "Support Azure CLI credential (az login)",
            "Support Managed Identity for CI/CD scenarios",
            "Abstract authentication behind a credential provider interface"
          ],
          "dod": "ADO authentication works with PAT, Azure CLI, and Managed Identity.",
          "verifications": [
            "PAT authentication sends correct Authorization header",
            "Azure CLI credential is retrieved and used correctly",
            "Managed Identity authentication works in supported environments",
            "Clear error messages when credentials are missing or invalid"
          ]
        },
        {
          "id": "S06-T02",
          "title": "Implement AdoSkillSourceProvider",
          "completed": true,
          "description": "Implement ISkillSourceProvider using the ADO Git REST API: use the Items API (GET /items?scopePath={skillPath}&recursionLevel=Full) to list files; use the Items API with download=true to fetch raw file content; use the Commits API (GET /commits?searchCriteria.itemPath={skillPath}&$top=1) to resolve the latest commit SHA.",
          "apiReferences": [
            "ISkillSourceProvider"
          ],
          "requirements": [
            "Implement GetRegistryIndexAsync using ADO Items API",
            "Implement ListSkillFilesAsync using Items API with recursionLevel=Full",
            "Implement DownloadFileAsync using Items API with download=true",
            "Implement GetLatestCommitShaAsync using ADO Commits API",
            "Set ProviderType to 'azuredevops'"
          ],
          "dod": "AdoSkillSourceProvider correctly implements all ISkillSourceProvider methods.",
          "verifications": [
            "ListSkillFilesAsync returns all files in a skill directory",
            "DownloadFileAsync retrieves correct file content",
            "GetLatestCommitShaAsync returns the correct commit SHA",
            "GetRegistryIndexAsync parses the index correctly"
          ]
        }
      ]
    },
    {
      "id": "S07",
      "title": "Skill Installation Engine",
      "description": "Implement the core logic for installing, updating, and managing agent skills on the local system. The installation pipeline: resolve packages → match skills → check cache → download → parse & validate → write to disk → track state.",
      "tasks": [
        {
          "id": "S07-T01",
          "title": "Implement 'install' Command",
          "completed": true,
          "description": "Add the 'install' subcommand that orchestrates the full pipeline: resolve packages → match skills → check cache → fetch via provider → validate → install. Report which skills were installed, skipped (already up-to-date), or failed.",
          "apiReferences": [
            "ISkillInstaller",
            "InstallOptions",
            "InstallResult"
          ],
          "requirements": [
            "Orchestrate the full 7-step installation pipeline",
            "Report installed, updated, skipped, and failed skills",
            "Support --dry-run to preview without changes",
            "Accept optional --project/-p argument for project/solution path"
          ],
          "dod": "'smart-skills install' runs the full pipeline and reports results.",
          "verifications": [
            "New skills are downloaded and installed correctly",
            "Up-to-date skills are skipped with appropriate message",
            "Failed skills are reported with clear error messages",
            "--dry-run shows what would happen without making changes"
          ]
        },
        {
          "id": "S07-T02",
          "title": "Implement SKILL.md Frontmatter Parser & Validator",
          "completed": true,
          "description": "Parse YAML frontmatter from SKILL.md files and validate against the Agent Skills spec constraints: required name and description fields, name format rules, optional license (string), compatibility (≤500 chars), metadata (string→string map), and allowed-tools (space-delimited string).",
          "apiReferences": [
            "ISkillMetadataParser",
            "SkillMetadata"
          ],
          "requirements": [
            "Parse YAML frontmatter between --- delimiters",
            "Validate required fields: name (1-64 chars, lowercase alphanumeric + hyphens), description (1-1024 chars)",
            "Validate optional fields: license, compatibility (≤500 chars), metadata, allowed-tools",
            "Return validation errors list for invalid skills",
            "Reject skills that fail validation with clear error messages"
          ],
          "dod": "ISkillMetadataParser correctly parses and validates SKILL.md frontmatter.",
          "verifications": [
            "Valid SKILL.md parses correctly into SkillMetadata",
            "Missing required fields produce validation errors",
            "Name format violations are detected (uppercase, special chars, too long)",
            "Oversized description/compatibility fields are rejected"
          ]
        },
        {
          "id": "S07-T03",
          "title": "Implement Local Skill Storage",
          "completed": true,
          "description": "Define the local file system layout for installed skills. Each skill is stored as a directory matching its name field, containing the full directory tree from the remote source. Maintain a local state file tracking installed skills, their source provider, commit SHA, and install timestamp.",
          "apiReferences": [
            "ISkillStore",
            "InstalledSkill"
          ],
          "requirements": [
            "Store each skill in a directory matching its name under the configured output path",
            "Preserve full directory structure (SKILL.md, scripts/, references/, assets/)",
            "Maintain a state file (JSON) tracking all installed skills",
            "State file includes: name, source provider type, source URL, commit SHA, install timestamp",
            "Support concurrent read access to the state file"
          ],
          "dod": "ISkillStore manages local skill storage with state tracking.",
          "verifications": [
            "Skills are stored in correctly named directories",
            "State file is created and updated on install",
            "GetInstalledSkillsAsync returns all tracked skills",
            "GetByNameAsync returns a specific skill or null",
            "RemoveAsync cleans up both directory and state entry"
          ]
        },
        {
          "id": "S07-T04",
          "title": "Implement Skill Update Detection",
          "completed": true,
          "description": "Compare the locally cached commit SHA against the latest SHA from the provider. When the SHA differs, flag the skill as having an update available.",
          "apiReferences": [
            "InstalledSkill.CommitSha",
            "ISkillSourceProvider.GetLatestCommitShaAsync"
          ],
          "requirements": [
            "Compare local CommitSha against remote GetLatestCommitShaAsync result",
            "Flag skills with different SHA as having updates available",
            "Support batch checking across all installed skills",
            "Report update status in list/status commands"
          ],
          "dod": "Update detection correctly identifies skills with newer remote versions.",
          "verifications": [
            "Skill with matching SHA is reported as up-to-date",
            "Skill with different SHA is reported as having update available",
            "Newly installed skill has correct SHA recorded"
          ]
        },
        {
          "id": "S07-T05",
          "title": "Implement Skill Uninstallation",
          "completed": true,
          "description": "Add the ability to remove installed skills cleanly by deleting the skill directory and removing its entry from the local state file.",
          "apiReferences": [
            "ISkillInstaller.UninstallAsync",
            "ISkillStore.RemoveAsync"
          ],
          "requirements": [
            "Delete the skill directory and all its contents",
            "Remove the skill entry from the local state file",
            "Handle missing skills gracefully (already uninstalled)",
            "Support uninstall by skill name"
          ],
          "dod": "Skill uninstallation removes directory and state tracking cleanly.",
          "verifications": [
            "Skill directory is fully deleted after uninstall",
            "State file no longer contains the uninstalled skill",
            "Uninstalling a non-existent skill does not error",
            "Subsequent install after uninstall downloads fresh copy"
          ]
        }
      ]
    },
    {
      "id": "S08",
      "title": "Configuration Management",
      "description": "Implement user and project-level configuration for registry sources, credentials, and tool behavior.",
      "tasks": [
        {
          "id": "S08-T01",
          "title": "Implement Configuration File Support",
          "completed": true,
          "description": "Support a JSON/YAML configuration file for persistent settings, with user-level and project-level overrides.",
          "apiReferences": [
            "IConfigProvider",
            "SmartSkillsConfig"
          ],
          "requirements": [
            "Support JSON configuration file format",
            "User-level config in standard app data location",
            "Project-level config overrides user-level settings",
            "CLI --config flag overrides both",
            "Use IConfigProvider abstraction for loading"
          ],
          "dod": "Configuration loads with correct precedence: CLI > project > user-level.",
          "verifications": [
            "User-level config is loaded from standard location",
            "Project-level config overrides user-level",
            "--config flag overrides all other sources",
            "Missing config files are handled gracefully"
          ]
        },
        {
          "id": "S08-T02",
          "title": "Implement Multi-Source Registry Configuration",
          "completed": true,
          "description": "Allow users to configure multiple skill registry sources (mix of GitHub and ADO) with priority ordering.",
          "apiReferences": [
            "SmartSkillsConfig.Sources",
            "SourceProviderConfig"
          ],
          "requirements": [
            "Support multiple source providers in configuration",
            "Each source specifies ProviderType, Url, optional RegistryIndexPath, optional CredentialKey",
            "Sources are queried in priority order (first match wins)",
            "Support mixing GitHub and ADO sources"
          ],
          "dod": "Multiple skill sources can be configured and queried in priority order.",
          "verifications": [
            "Multiple sources are loaded from config",
            "Sources are queried in configured order",
            "Mixed GitHub and ADO sources work together",
            "Invalid source configs produce clear error messages"
          ]
        },
        {
          "id": "S08-T03",
          "title": "Implement Credential Storage",
          "completed": true,
          "description": "Provide secure storage for ADO tokens and GitHub PATs, avoiding plaintext storage in config files.",
          "requirements": [
            "Never store credentials in plaintext config files",
            "Support environment variable-based credential injection",
            "Support credential references (CredentialKey) in config that map to secure storage",
            "Provide clear error when required credentials are missing"
          ],
          "dod": "Credentials are stored securely and never appear in plaintext config.",
          "verifications": [
            "Credentials from environment variables are used correctly",
            "Config files do not contain plaintext credentials",
            "Missing credentials produce actionable error messages",
            "CredentialKey references resolve correctly"
          ]
        }
      ]
    },
    {
      "id": "S09",
      "title": "Error Handling, Resilience & Caching",
      "description": "Implement robust error handling, retry logic, and caching to ensure reliable operation.",
      "tasks": [
        {
          "id": "S09-T01",
          "title": "Implement Retry Policy with Exponential Backoff",
          "completed": true,
          "description": "Add configurable retry logic for all HTTP operations with exponential backoff and jitter.",
          "requirements": [
            "Retry transient HTTP failures (5xx, timeouts, rate limits)",
            "Use exponential backoff with jitter",
            "Make retry count and base delay configurable",
            "Log retry attempts at appropriate verbosity levels"
          ],
          "dod": "All HTTP operations retry transient failures with configurable backoff.",
          "verifications": [
            "Transient failures trigger retries",
            "Backoff delay increases exponentially",
            "Retry count is configurable",
            "Non-transient failures (4xx) are not retried"
          ]
        },
        {
          "id": "S09-T02",
          "title": "Implement Local Cache",
          "completed": true,
          "description": "Cache registry indexes and skill manifests locally to reduce network calls and enable offline browsing.",
          "requirements": [
            "Cache registry index responses locally",
            "Cache skill manifests (SKILL.md frontmatter) locally",
            "Invalidate cache based on commit SHA changes",
            "Support offline mode using cached data"
          ],
          "dod": "Registry indexes and manifests are cached locally for performance and offline use.",
          "verifications": [
            "Second request for same registry uses cached data",
            "Cache is invalidated when commit SHA changes",
            "Offline mode works with previously cached data",
            "Cache location is configurable"
          ]
        },
        {
          "id": "S09-T03",
          "title": "Implement Structured Error Reporting",
          "completed": true,
          "description": "Provide clear, actionable error messages with error codes and suggested fixes.",
          "requirements": [
            "Define error codes for common failure scenarios",
            "Include suggested remediation in error messages",
            "Structured error output for JSON mode",
            "Verbose mode includes full stack traces"
          ],
          "dod": "All errors include codes, descriptions, and remediation suggestions.",
          "verifications": [
            "Network errors suggest checking connectivity",
            "Auth errors suggest checking credentials",
            "Missing SDK errors suggest installing .NET SDK",
            "--json mode outputs structured error objects"
          ]
        }
      ]
    },
    {
      "id": "S10",
      "title": "List & Status Commands",
      "description": "Provide commands to view installed skills, available skills, and overall status.",
      "tasks": [
        {
          "id": "S10-T01",
          "title": "Implement 'list' Command",
          "completed": true,
          "description": "Add a command to list installed skills with their versions, sources, and install dates.",
          "apiReferences": [
            "ISkillStore.GetInstalledSkillsAsync",
            "InstalledSkill"
          ],
          "requirements": [
            "List all installed skills with name, description, source provider, commit SHA, install date",
            "Support --json output format",
            "Show update-available status for each skill",
            "Support filtering by source provider"
          ],
          "dod": "'smart-skills list' shows all installed skills with metadata.",
          "verifications": [
            "All installed skills are listed",
            "Metadata (name, source, SHA, date) is displayed correctly",
            "--json output is valid JSON",
            "Update-available indicator shows for outdated skills"
          ]
        },
        {
          "id": "S10-T02",
          "title": "Implement 'status' Command",
          "completed": true,
          "description": "Add a command showing a summary of the current project context: detected libraries, matched skills, installed/missing skills.",
          "requirements": [
            "Show detected packages count and list",
            "Show matched skills from registry",
            "Show installed vs missing skills",
            "Show overall health status",
            "Support --json output format"
          ],
          "dod": "'smart-skills status' provides a full project context summary.",
          "verifications": [
            "Package count and list are accurate",
            "Matched skills reflect current registry state",
            "Missing skills are clearly identified",
            "Status summary is human-readable"
          ]
        }
      ]
    },
    {
      "id": "S11",
      "title": "Testing & Quality Assurance",
      "description": "Comprehensive testing strategy covering unit tests, integration tests, and end-to-end scenarios.",
      "tasks": [
        {
          "id": "S11-T01",
          "title": "Unit Tests for Core Logic",
          "completed": true,
          "description": "Write unit tests for library detection, skill matching, manifest parsing, and configuration loading.",
          "requirements": [
            "Test IPackageResolver with mocked CLI output",
            "Test ISkillMatcher with various pattern types",
            "Test ISkillMetadataParser with valid and invalid SKILL.md content",
            "Test IConfigProvider with layered configuration scenarios",
            "Use xUnit as the test framework"
          ],
          "dod": "Unit tests cover all core logic with >80% code coverage.",
          "verifications": [
            "All unit tests pass",
            "Edge cases are covered (empty input, invalid data, missing files)",
            "Tests use mocks/stubs for external dependencies"
          ]
        },
        {
          "id": "S11-T02",
          "title": "Integration Tests for Remote Fetching",
          "completed": true,
          "description": "Write integration tests that verify fetching from GitHub and ADO sources using recorded HTTP responses.",
          "requirements": [
            "Use recorded HTTP responses for deterministic testing",
            "Test both GitHub and ADO source providers",
            "Verify registry index parsing, file listing, and download",
            "Test commit SHA resolution"
          ],
          "dod": "Integration tests verify provider implementations against recorded responses.",
          "verifications": [
            "GitHub provider tests pass with recorded responses",
            "ADO provider tests pass with recorded responses",
            "All ISkillSourceProvider methods are covered"
          ]
        },
        {
          "id": "S11-T03",
          "title": "End-to-End CLI Tests",
          "completed": true,
          "description": "Write E2E tests that invoke the CLI as a subprocess and verify complete workflows.",
          "requirements": [
            "Invoke CLI as a subprocess",
            "Test scan, install, list, and status commands",
            "Verify exit codes and output format",
            "Test with sample projects"
          ],
          "dod": "E2E tests verify complete CLI workflows.",
          "verifications": [
            "All CLI commands produce expected output",
            "Exit codes are correct for success and failure",
            "JSON output is valid and contains expected data"
          ]
        },
        {
          "id": "S11-T04",
          "title": "MSBuild Integration Tests",
          "completed": true,
          "description": "Write tests that invoke MSBuild with sample projects referencing the SmartSkills.MSBuild package and verify skill acquisition during build.",
          "requirements": [
            "Create sample projects that reference SmartSkills.MSBuild",
            "Verify skills are acquired during build",
            "Test incremental build behavior",
            "Verify MSBuild task logging output"
          ],
          "dod": "MSBuild integration tests verify automatic skill acquisition during build.",
          "verifications": [
            "Build with SmartSkills.MSBuild acquires skills",
            "Incremental build skips unchanged skills",
            "Build output shows skill acquisition messages",
            "Build fails gracefully when sources are unavailable"
          ]
        }
      ]
    },
    {
      "id": "S12",
      "title": "Packaging & Distribution",
      "description": "Package the CLI tool for distribution as a .NET global tool and provide installation documentation.",
      "tasks": [
        {
          "id": "S12-T01",
          "title": "Package as .NET Global Tool",
          "completed": true,
          "description": "Configure the CLI project for distribution as a .NET global tool via NuGet.",
          "requirements": [
            "Set PackAsTool=true in project file",
            "Configure tool command name",
            "Include proper NuGet metadata (authors, description, license, tags)",
            "Support 'dotnet tool install -g' workflow"
          ],
          "dod": "CLI can be installed as a .NET global tool via NuGet.",
          "verifications": [
            "'dotnet pack' produces a valid NuGet package",
            "'dotnet tool install' installs the tool successfully",
            "Tool is accessible from PATH after installation",
            "NuGet package metadata is complete"
          ]
        },
        {
          "id": "S12-T02",
          "title": "Package MSBuild Targets as NuGet Package",
          "completed": true,
          "description": "Package the SmartSkills.MSBuild project as a NuGet package that delivers .props and .targets files, automatically integrating skill acquisition into any consuming project's build.",
          "requirements": [
            "Package .props and .targets files in the build/ folder of the NuGet package",
            "Include SmartSkills.Core and MSBuild task DLLs as package content",
            "Auto-import targets when the package is referenced",
            "Support PackageReference consumption model"
          ],
          "dod": "MSBuild package automatically integrates skill acquisition into consuming projects.",
          "verifications": [
            "'dotnet pack' produces a valid NuGet package with build/ folder",
            "Targets are auto-imported when package is added to a project",
            "Skill acquisition runs during build of consuming project",
            "Package works with both SDK-style and non-SDK-style projects"
          ]
        },
        {
          "id": "S12-T03",
          "title": "Create README and Usage Documentation",
          "completed": true,
          "description": "Write comprehensive README.md with installation instructions, usage examples, and configuration reference for both the MSBuild package and CLI tool.",
          "requirements": [
            "Installation instructions for both CLI tool and MSBuild package",
            "Usage examples for all CLI commands",
            "Configuration file reference with all options",
            "Troubleshooting section for common issues"
          ],
          "dod": "README.md provides complete usage documentation for both tools.",
          "verifications": [
            "All CLI commands are documented with examples",
            "Configuration format is fully documented",
            "Installation steps are accurate and tested",
            "Troubleshooting covers common failure scenarios"
          ]
        }
      ]
    },
    {
      "id": "S13",
      "title": "MSBuild Integration - Custom Tasks & Targets",
      "description": "Implement custom MSBuild tasks and targets that automatically acquire and install agent skills as part of the build pipeline. This is the primary skill acquisition mechanism — consumers simply add a PackageReference and skills are resolved at build time.",
      "tasks": [
        {
          "id": "S13-T01",
          "title": "Implement ResolveSmartSkills MSBuild Task",
          "completed": true,
          "description": "Create a custom MSBuild task (extending Microsoft.Build.Utilities.Task) that reads the project's PackageReference items, queries the skill registry, and outputs a list of skills to install.",
          "requirements": [
            "Extend Microsoft.Build.Utilities.Task",
            "Read PackageReference items from the project",
            "Query skill registry via ISkillSourceProvider",
            "Output ITaskItem[] of matched skills for downstream tasks"
          ],
          "dod": "ResolveSmartSkills task correctly identifies skills to install based on project references.",
          "verifications": [
            "Task reads PackageReference items correctly",
            "Task queries registry and returns matched skills",
            "Output items contain skill path and provider information",
            "Task logs appropriate messages during execution"
          ]
        },
        {
          "id": "S13-T02",
          "title": "Implement InstallSmartSkills MSBuild Task",
          "completed": true,
          "description": "Create a custom MSBuild task that takes the resolved skills list and downloads/installs each skill to the configured output directory.",
          "requirements": [
            "Accept resolved skills list from ResolveSmartSkills output",
            "Download and install each skill via ISkillSourceProvider",
            "Support commit-SHA cache checking for incremental builds",
            "Output installed skill paths for downstream consumption"
          ],
          "dod": "InstallSmartSkills task downloads and installs matched skills during build.",
          "verifications": [
            "Skills are downloaded and placed in the output directory",
            "Cached skills are skipped",
            "Failed downloads are reported as build warnings/errors",
            "Task produces correct output items"
          ]
        },
        {
          "id": "S13-T03",
          "title": "Author .props and .targets Files",
          "completed": true,
          "description": "Create the MSBuild .props and .targets files that wire the custom tasks into the build pipeline with correct ordering, default property values, and incremental build support.",
          "requirements": [
            "Create .props file with default property values",
            "Create .targets file with task UsingTask declarations and target definitions",
            "Wire targets into correct build phase (after ResolvePackageAssets)",
            "Support incremental build with Inputs/Outputs",
            "Allow property overrides for customization"
          ],
          "dod": ".props and .targets files correctly integrate skill acquisition into the build pipeline.",
          "verifications": [
            "Targets run automatically during build",
            "Incremental build skips unchanged skills",
            "Default properties can be overridden",
            "Target ordering is correct relative to other build targets"
          ]
        },
        {
          "id": "S13-T04",
          "title": "Implement MSBuild Diagnostic Logging & Build Output",
          "completed": true,
          "description": "Provide clear build output showing skill acquisition progress, using MSBuild message importance levels appropriately.",
          "requirements": [
            "Use MessageImportance.High for skill install/skip summary",
            "Use MessageImportance.Normal for per-skill details",
            "Use MessageImportance.Low for verbose/debug info",
            "Report errors and warnings using MSBuild Log.LogError/LogWarning"
          ],
          "dod": "Build output clearly shows skill acquisition status at appropriate verbosity levels.",
          "verifications": [
            "Normal verbosity shows summary of installed/skipped skills",
            "Detailed verbosity shows per-skill information",
            "Errors appear as MSBuild errors in build output",
            "Output is readable in Visual Studio Error List"
          ]
        },
        {
          "id": "S13-T05",
          "title": "Handle MSBuild Task Assembly Loading & Dependencies",
          "completed": true,
          "description": "Ensure the MSBuild task DLL and its dependencies (SmartSkills.Core, HTTP libraries, etc.) load correctly in the MSBuild process without conflicting with the host project's assemblies.",
          "requirements": [
            "Use MSBuildSdkResolver or assembly resolution hooks if needed",
            "Avoid assembly version conflicts with host project",
            "Bundle dependencies correctly in the NuGet package",
            "Test with different MSBuild host scenarios (dotnet build, VS, msbuild.exe)"
          ],
          "dod": "MSBuild tasks load correctly without assembly conflicts in all host scenarios.",
          "verifications": [
            "Tasks work with 'dotnet build'",
            "Tasks work within Visual Studio",
            "No assembly loading errors or version conflicts",
            "Dependencies are resolved correctly at build time"
          ]
        },
        {
          "id": "S13-T06",
          "title": "Support NuGet Restore-Time vs Build-Time Skill Acquisition",
          "completed": true,
          "description": "Determine and implement the correct MSBuild phase for skill acquisition, balancing between restore-time (earlier, but limited) and build-time (full access to resolved references).",
          "requirements": [
            "Evaluate restore-time vs build-time tradeoffs",
            "Implement skill acquisition in the appropriate phase",
            "Ensure resolved PackageReference items are available when tasks run",
            "Handle the case where restore hasn't completed yet"
          ],
          "dod": "Skill acquisition runs at the correct build phase with access to resolved dependencies.",
          "verifications": [
            "Tasks have access to resolved PackageReference items",
            "Acquisition timing doesn't interfere with other build tasks",
            "Works correctly with 'dotnet build' (implicit restore) and explicit restore"
          ]
        },
        {
          "id": "S13-T07",
          "title": "Support Multi-Targeting and Solution-Level Builds",
          "completed": true,
          "description": "Ensure skill acquisition works correctly for multi-targeting projects and solution-level builds without duplicate acquisition.",
          "requirements": [
            "Deduplicate skill acquisition across target frameworks in multi-targeting projects",
            "Handle solution-level builds without acquiring skills multiple times for the same project",
            "Support TargetFrameworks (plural) projects correctly",
            "Use sentinel files or build markers to prevent duplicate work"
          ],
          "dod": "Skill acquisition is correct and efficient for multi-targeting and solution builds.",
          "verifications": [
            "Multi-targeting project acquires skills only once",
            "Solution build doesn't duplicate skill acquisition across projects",
            "Skills are available to all target frameworks after acquisition"
          ]
        }
      ]
    },
    {
      "id": "S14",
      "title": "Skills Lock File",
      "description": "Introduce a version-controlled lock file (smart-skills.lock.json) that records the exact fetch coordinates and integrity hashes of all tracked skills. Replaces the internal .agents-skills-state.json with a committable, deterministic, cross-platform file that enables reproducible skill installations and local edit detection. See spec/lock-file.md for full specification.",
      "tasks": [
        {
          "id": "S14-T01",
          "title": "Define Lock File Model & Serialization",
          "completed": true,
          "description": "Create the data model for smart-skills.lock.json (SkillsLockFile, SkillLockEntry records) and implement deterministic JSON serialization/deserialization. The lock file uses a flat skill-name-keyed map with alphabetically sorted keys for stable diffs.",
          "requirements": [
            "Define SkillsLockFile record with Version (int) and Skills (dictionary of string to SkillLockEntry)",
            "Define SkillLockEntry record with RemoteUrl, SkillPath, Language (optional), CommitSha, LocalContentHash fields",
            "Serialize with sorted keys (ordinal), indented JSON, camelCase property naming",
            "Deserialize with validation: reject unknown version numbers, require all mandatory fields",
            "Use System.Text.Json with custom options for deterministic output",
            "File name constant: smart-skills.lock.json"
          ],
          "dod": "SkillsLockFile model round-trips through JSON serialization producing identical, deterministic output.",
          "verifications": [
            "Serialization produces alphabetically sorted skill keys",
            "Round-trip serialize/deserialize produces identical object",
            "Missing required fields cause clear validation errors",
            "Unknown version number is rejected with descriptive error",
            "Null/empty Language field is omitted from JSON output"
          ],
          "apiReferences": [
            "SkillsLockFile",
            "SkillLockEntry"
          ]
        },
        {
          "id": "S14-T02",
          "title": "Implement Cross-Platform Content Hashing",
          "completed": true,
          "description": "Implement the SkillContentHasher that computes a deterministic SHA256 content hash over a skill directory. The hash must be identical on Windows, macOS, and Linux. Algorithm: enumerate files recursively (excluding hidden), normalize paths to forward-slash NFC form, sort ordinally, hash each file's raw bytes, concatenate '<path>\\n<hash>\\n', then SHA256 the result.",
          "requirements": [
            "Enumerate all files recursively, excluding hidden files/directories (starting with '.')",
            "Normalize relative paths: forward slashes, NFC Unicode normalization (String.Normalize(NormalizationForm.FormC))",
            "Sort paths using StringComparison.Ordinal",
            "Read file content as raw bytes (no line-ending conversion)",
            "Compute SHA256 of each file's raw bytes as lowercase hex",
            "Concatenate entries as UTF-8: '<relative-path>\\n<file-sha256>\\n' using literal \\n",
            "Compute final SHA256 of concatenated UTF-8 bytes",
            "Return result as 'sha256:<lowercase-hex>'",
            "Handle empty directories (return hash of empty input)"
          ],
          "dod": "SkillContentHasher produces identical hashes for the same directory content on Windows, macOS, and Linux.",
          "verifications": [
            "Same directory produces identical hash across repeated calls",
            "Adding a file changes the hash",
            "Modifying file content changes the hash",
            "Renaming a file changes the hash",
            "Path separators do not affect hash (backslash vs forward slash)",
            "Files with different line endings but same raw bytes produce same hash",
            "Hidden files (starting with '.') are excluded",
            "Empty directory produces a consistent hash"
          ],
          "apiReferences": [
            "SkillContentHasher"
          ]
        },
        {
          "id": "S14-T03",
          "title": "Implement Lock File Reader/Writer",
          "completed": true,
          "description": "Implement ISkillLockFileStore that reads and writes smart-skills.lock.json from/to disk. Replaces the existing ISkillStore/LocalSkillStore for state tracking.",
          "requirements": [
            "Define ISkillLockFileStore interface with LoadAsync, SaveAsync, and file path resolution",
            "LoadAsync returns empty SkillsLockFile when file does not exist",
            "SaveAsync writes deterministic JSON (sorted keys, indented, camelCase)",
            "Resolve lock file path relative to the project/solution root directory",
            "Validate schema version on load and reject unsupported versions"
          ],
          "dod": "ISkillLockFileStore correctly reads and writes smart-skills.lock.json with deterministic output.",
          "verifications": [
            "Loading non-existent file returns default empty lock file",
            "Save then load round-trip produces identical object",
            "Output JSON has sorted keys and consistent formatting",
            "Unsupported version number throws descriptive exception",
            "Lock file is written next to the project/solution file"
          ],
          "apiReferences": [
            "ISkillLockFileStore",
            "SkillsLockFile"
          ]
        },
        {
          "id": "S14-T04",
          "title": "Integrate Lock File into Install Workflow",
          "completed": false,
          "description": "Refactor SkillInstaller to use the lock file for change detection during install. For each matched skill: check lock file for existing entry, compare remote commit SHA, compute local content hash to detect edits, download only when needed, and update lock file entries.",
          "requirements": [
            "Read existing lock file before installing",
            "For skills in lock file: fetch remote commit SHA and compare against recorded commitSha",
            "If commitSha matches: compute local content hash and compare against localContentHash",
            "If localContentHash differs: warn about local modifications, skip unless --force flag is set",
            "If commitSha differs: download new version and update lock entry",
            "For new skills not in lock file: download, compute content hash, add lock entry",
            "Write updated lock file after all operations (sorted, deterministic)",
            "Support --force flag to overwrite locally modified skills"
          ],
          "dod": "Install command uses lock file for incremental change detection and updates lock file after installation.",
          "verifications": [
            "Skill with matching commitSha and localContentHash is skipped",
            "Skill with different remote commitSha is re-downloaded and lock entry updated",
            "Locally modified skill shows warning and is skipped without --force",
            "Locally modified skill is overwritten with --force",
            "New skill is downloaded and added to lock file",
            "Lock file is written with sorted keys after install"
          ],
          "apiReferences": [
            "ISkillInstaller",
            "SkillsLockFile",
            "SkillContentHasher"
          ]
        },
        {
          "id": "S14-T05",
          "title": "Implement Restore Command",
          "completed": false,
          "description": "Add a 'restore' CLI command that reproduces the exact skill set from the lock file without re-resolving packages or querying registries. Downloads skills at the specific commitSha recorded in the lock file for full reproducibility.",
          "requirements": [
            "Read lock file and iterate all skill entries",
            "If skill directory exists and localContentHash matches: skip",
            "Otherwise: download skill files at the exact recorded commitSha (not latest)",
            "Requires ISkillSourceProvider support for fetching at a specific git ref",
            "Recompute and verify localContentHash after download",
            "Report restored, skipped, and failed skills",
            "Fail gracefully if lock file does not exist"
          ],
          "dod": "'smart-skills restore' reproduces the exact skill set from the lock file.",
          "verifications": [
            "Missing skills are downloaded at the recorded commitSha",
            "Up-to-date skills (matching content hash) are skipped",
            "Content hash is verified after download",
            "Missing lock file produces a clear error message",
            "Restored skills match the original content hash"
          ],
          "apiReferences": [
            "ISkillInstaller",
            "SkillsLockFile",
            "ISkillSourceProvider"
          ]
        },
        {
          "id": "S14-T06",
          "title": "Integrate Lock File into Status Command",
          "completed": false,
          "description": "Update the 'status' CLI command to report lock file state: which skills are up-to-date, locally modified, or have remote updates available.",
          "requirements": [
            "Read lock file and check each skill entry",
            "Compute current local content hash and compare against lock file localContentHash",
            "Report skills as: up-to-date, locally modified, missing from disk, or not in lock file",
            "Optionally fetch remote commit SHA to detect available updates (with --check-remote flag)",
            "Show summary counts (total, up-to-date, modified, updates available)"
          ],
          "dod": "'smart-skills status' reports lock file state including local modification detection.",
          "verifications": [
            "Unmodified skills show as up-to-date",
            "Modified local files are detected and reported",
            "Missing skill directories are reported",
            "Remote update detection works when --check-remote is specified"
          ],
          "apiReferences": [
            "SkillsLockFile",
            "SkillContentHasher"
          ]
        },
        {
          "id": "S14-T07",
          "title": "Integrate Lock File into Uninstall Command",
          "completed": false,
          "description": "Update the 'uninstall' command to remove the skill entry from the lock file in addition to deleting the skill directory from disk.",
          "requirements": [
            "Remove skill directory from disk",
            "Remove skill entry from lock file",
            "Write updated lock file (sorted, deterministic)",
            "Handle gracefully: skill not in lock file, skill directory already missing"
          ],
          "dod": "'smart-skills uninstall' removes both the skill directory and the lock file entry.",
          "verifications": [
            "Skill entry is removed from lock file after uninstall",
            "Skill directory is deleted from disk",
            "Lock file is rewritten with sorted keys",
            "Uninstalling a skill not in lock file does not error",
            "Uninstalling a skill with missing directory still removes lock entry"
          ],
          "apiReferences": [
            "ISkillInstaller",
            "ISkillLockFileStore"
          ]
        },
        {
          "id": "S14-T08",
          "title": "Migrate from .agents-skills-state.json",
          "completed": false,
          "description": "Remove the old LocalSkillStore/.agents-skills-state.json state file mechanism and replace all usages with the new lock file store. Add one-time migration logic to convert existing state files to lock file format.",
          "requirements": [
            "Detect existing .agents-skills-state.json on first run with new code",
            "Convert InstalledSkill entries to SkillLockEntry format (map SourceUrl to remoteUrl, CommitSha to commitSha, etc.)",
            "Compute localContentHash for each already-installed skill directory",
            "Write smart-skills.lock.json with migrated entries",
            "Delete .agents-skills-state.json after successful migration",
            "Remove LocalSkillStore class and ISkillStore interface once migration is in place",
            "Log migration activity for user awareness"
          ],
          "dod": "Old state file is automatically migrated to lock file format; LocalSkillStore/ISkillStore removed.",
          "verifications": [
            "Existing .agents-skills-state.json is detected and migrated",
            "Migrated lock file contains equivalent entries with correct content hashes",
            "Old state file is deleted after migration",
            "Projects without old state file work normally (no migration needed)",
            "ISkillStore references are replaced throughout codebase"
          ],
          "apiReferences": [
            "ISkillLockFileStore",
            "SkillsLockFile",
            "LocalSkillStore"
          ]
        },
        {
          "id": "S14-T09",
          "title": "Add Provider Support for Fetching at Specific Commit",
          "completed": false,
          "description": "Extend ISkillSourceProvider with the ability to fetch skill files at a specific git commit SHA (not just latest). Required by the 'restore' command to reproduce exact skill versions from the lock file.",
          "requirements": [
            "Add optional commitSha parameter to ListSkillFilesAsync and DownloadFileAsync",
            "GitHubSkillSourceProvider: use Git Trees API with specific SHA ref instead of default branch",
            "AdoSkillSourceProvider: use Items API with versionDescriptor for specific commit",
            "Fall back to latest if commitSha is not provided (backward compatible)"
          ],
          "dod": "ISkillSourceProvider implementations can fetch files at a specific commit SHA.",
          "verifications": [
            "GitHub provider fetches files at a specific commit SHA",
            "ADO provider fetches files at a specific commit SHA",
            "Omitting commitSha fetches from default branch (backward compatible)",
            "Invalid commit SHA produces clear error message"
          ],
          "apiReferences": [
            "ISkillSourceProvider",
            "GitHubSkillSourceProvider",
            "AdoSkillSourceProvider"
          ]
        }
      ]
    }
  ]
}
